import WrapDataManager from '~/managers/WrapDataManager'

const bg = WrapDataManager.toI18n({
  commands: {
    help: {
      description: 'Начин на употреба на BOT',
      embeds: [{
        contents: ['Текущо избраният език', 'Преместване нагоре', 'Преместване надолу', 'Активиране на езика', 'Деактивиране на езика'],
        description: '**`/setting` Можете да настроите чрез командата**',
        footer: {
          text: '※Тази команда може да се използва само ако имате пълни права'
        },
        title: 'Метод за настройка на езика:'
      }, {
        contents: ['Десен клик', 'Клик'],
        type: 'PC'
      }, {
        contents: ['Задържане', 'Докосване'],
        type: 'Смартфон'
      }],
      howToUseEmbed: {
        contents: ['Изберете съобщението, което искате да преведете {0}', '`Приложение` за {0}', '`Преведи` за {0}', 'Изберете желания език {0}', 'Преводът е завършен'],
        description: 'Стъпки:',
        title: 'Начин на употреба ({0}):'
      }
    },
    language: {
      description: 'Настройте езика за превод',
      embed: {
        footer: {
          text: 'Максимален брой настройки на езика: {0} / {1}'
        },
        title: 'Екран за настройка на езика на превода:'
      },
      maxDataLength: '>>> **※Можете да настроите до {0} езика максимум**'
    },
    translation: {
      content: '>>> **※На кой език да превеждаме?**',
      selectLang: '>>> **※Превежда се на {0}...**',
      undefined: '>>> **※Езикът за превод не е зададен\nМоля, задайте го в `/setting`**'
    }
  },
  localizedNames: {
    bg: 'Български',
    cs: 'Чешки',
    da: 'Датски',
    de: 'Немски',
    el: 'Гръцки',
    'en-GB': 'Английски, Великобритания',
    'en-US': 'Английски, САЩ',
    'es-ES': 'Испански',
    fi: 'Фински',
    fr: 'Френски',
    hi: 'Хинди',
    hr: 'Хърватски',
    hu: 'Унгарски',
    id: 'Индонезийски',
    it: 'Италиански',
    ja: 'Японски',
    ko: 'Корейски',
    lt: 'Литовски',
    nl: 'Нидерландски',
    no: 'Норвежки',
    pl: 'Полски',
    'pt-BR': 'Португалски, Бразилия',
    ro: 'Румънски',
    ru: 'Руски',
    'sv-SE': 'Шведски',
    th: 'Тайски',
    tr: 'Турски',
    uk: 'Украински',
    vi: 'Виетнамски',
    'zh-CN': 'Китайски',
    'zh-TW': 'Тайван, Китайски'
  }
})

export default bg
