import WrapDataManager from '~/managers/WrapDataManager'

const bg = WrapDataManager.toI18n({
  commands: {
    language: {
      description: 'Настройте езика за превод',
      embed: {
        footer: {
          text: 'Максимален брой настройки на езика: {0} / {1}'
        },
        title: 'Екран за настройка на езика на превода:'
      },
      maxDataLength: '>>> **※Можете да настроите до {0} езика максимум**'
    },
    translation: {
      content: '>>> **※На кой език да превеждаме?**',
      selectLang: '>>> **※Превежда се на {0}...**',
      undefined: '>>> **※Езикът за превод не е зададен\nМоля, задайте го в `/setting`**'
    }
  },
  localizedNames: {
    bg: 'Български',
    cs: 'Чешки',
    da: 'Датски',
    de: 'Немски',
    el: 'Гръцки',
    'en-GB': 'Английски, Великобритания',
    'en-US': 'Английски, САЩ',
    'es-ES': 'Испански',
    fi: 'Фински',
    fr: 'Френски',
    hi: 'Хинди',
    hr: 'Хърватски',
    hu: 'Унгарски',
    id: 'Индонезийски',
    it: 'Италиански',
    ja: 'Японски',
    ko: 'Корейски',
    lt: 'Литовски',
    nl: 'Нидерландски',
    no: 'Норвежки',
    pl: 'Полски',
    'pt-BR': 'Португалски, Бразилия',
    ro: 'Румънски',
    ru: 'Руски',
    'sv-SE': 'Шведски',
    th: 'Тайски',
    tr: 'Турски',
    uk: 'Украински',
    vi: 'Виетнамски',
    'zh-CN': 'Китайски',
    'zh-TW': 'Тайван, Китайски'
  }
})

export default bg
