import WrapDataManager from '~/managers/WrapDataManager'

const el = WrapDataManager.toI18n({
  commands: {
    help: {
      description: 'Οδηγίες χρήσης του BOT',
      embeds: [{
        contents: ['Τρέχουσα επιλεγμένη γλώσσα', 'Μετακίνηση προς τα πάνω', 'Μετακίνηση προς τα κάτω', 'Ενεργοποίηση γλώσσας', 'Απενεργοποίηση γλώσσας'],
        description: '**</setting:{0}> Ρυθμίστε μέσω της εντολής**',
        footer: {
          text: '※Αυτή η εντολή μπορεί να χρησιμοποιηθεί μόνο εάν έχετε πλήρη δικαιώματα'
        },
        title: 'Μέθοδος ρύθμισης γλώσσας:'
      }, {
        contents: ['Δεξί κλικ', 'Κλικ'],
        type: 'Υπολογιστής'
      }, {
        contents: ['Παρατεταμένη πίεση', 'Άγγιγμα'],
        type: 'Κινητό'
      }],
      howToUseEmbed: {
        contents: ['Επιλέξτε το μήνυμα που θέλετε να μεταφράσετε {0}', '`Εφαρμογή` για {0}', '`Μετάφραση` για {0}', 'Επιλέξτε τη γλώσσα που επιθυμείτε {0}', 'Η μετάφραση ολοκληρώθηκε'],
        description: 'Βήματα:',
        title: 'Οδηγίες χρήσης ({0}):'
      }
    },
    language: {
      description: 'Ορισμός γλώσσας μετάφρασης',
      embed: {
        footer: {
          text: 'Μέγιστος αριθμός ρυθμίσεων γλώσσας: {0} / {1}'
        },
        title: 'Οθόνη ρυθμίσεων γλώσσας μετάφρασης:'
      },
      maxDataLength: '>>> **※Μπορείτε να ρυθμίσετε μέχρι και {0} γλώσσες**'
    },
    translation: {
      content: '>>> **※Σε ποια γλώσσα να μεταφράσετε;**',
      selectLang: '>>> **※Μετάφραση σε {0}...**',
      undefined: '>>> **※Η γλώσσα μετάφρασης δεν έχει οριστεί\nΠαρακαλώ ρυθμίστε το στο `/setting`**'
    }
  },
  localizedNames: {
    bg: 'Βουλγαρικά',
    cs: 'Τσέχικα',
    da: 'Δανικά',
    de: 'Γερμανικά',
    el: 'Ελληνικά',
    'en-GB': 'Αγγλικά, Ηνωμένο Βασίλειο',
    'en-US': 'Αγγλικά, ΗΠΑ',
    'es-ES': 'Ισπανικά',
    fi: 'Φινλανδικά',
    fr: 'Γαλλικά',
    hi: 'Χίντι',
    hr: 'Κροατικά',
    hu: 'Ουγγρικά',
    id: 'Ινδονησιακά',
    it: 'Ιταλικά',
    ja: 'Ιαπωνικά',
    ko: 'Κορεατικά',
    lt: 'Λιθουανικά',
    nl: 'Ολλανδικά',
    no: 'Νορβηγικά',
    pl: 'Πολωνικά',
    'pt-BR': 'Πορτογαλικά, Βραζιλία',
    ro: 'Ρουμανικά',
    ru: 'Ρωσικά',
    'sv-SE': 'Σουηδικά',
    th: 'Ταϊλανδέζικα',
    tr: 'Τουρκικά',
    uk: 'Ουκρανικά',
    vi: 'Βιετναμέζικα',
    'zh-CN': 'Κινεζικά',
    'zh-TW': 'Κινεζικά, Ταϊβάν'
  }
})

export default el