import WrapDataManager from '~/managers/WrapDataManager'

const hi = WrapDataManager.toI18n({
  commands: {
    help: {
      description: 'BOT का उपयोग कैसे करें',
      embeds: [{
        contents: ['वर्तमान में चयनित भाषा', 'ऊपर ले जाएँ', 'नीचे ले जाएँ', 'भाषा सक्रिय करें', 'भाषा निष्क्रिय करें'],
        description: '**</setting:{0}> आदेश के माध्यम से सेट किया जा सकता है**',
        footer: {
          text: '※यह आदेश केवल पूर्ण अनुमतियों वाले उपयोगकर्ता द्वारा ही उपयोग किया जा सकता है'
        },
        title: 'भाषा सेटिंग की विधि:'
      }, {
        contents: ['राइट क्लिक', 'क्लिक'],
        type: 'PC'
      }, {
        contents: ['लंबे समय तक दबाए रखें', 'टैप करें'],
        type: 'स्मार्टफोन'
      }],
      howToUseEmbed: {
        contents: ['अनुवाद करने के लिए संदेश चुनें {0}', '`एप्लिकेशन` के लिए {0}', '`अनुवाद करें` के लिए {0}', 'वांछित भाषा चुनें {0}', 'अनुवाद पूरा हुआ'],
        description: 'चरण:',
        title: 'उपयोग कैसे करें ({0}):'
      }
    },
    language: {
      description: 'अनुवाद के लिए भाषा सेट करें',
      embed: {
        footer: {
          text: 'अधिकतम भाषा सेटिंग्स की संख्या: {0} / {1}'
        },
        title: 'अनुवाद भाषा सेटिंग स्क्रीन:'
      },
      maxDataLength: '>>> **※अधिकतम {0} भाषाएँ ही सेट की जा सकती हैं**'
    },
    translation: {
      content: '>>> **※किस भाषा में अनुवाद करें?**',
      selectLang: '>>> **※{0} में अनुवाद कर रहा है...**',
      undefined: '>>> **※अनुवाद भाषा सेट नहीं की गई हैकृपया `/setting` में सेट करें** '
    }
  },
  localizedNames: {
    bg: 'बल्गेरियाई',
    cs: 'चेक',
    da: 'डैनिश',
    de: 'जर्मन',
    el: 'ग्रीक',
    'en-GB': 'अंग्रेज़ी, यूके',
    'en-US': 'अंग्रेज़ी, यूएसए',
    'es-ES': 'स्पैनिश',
    fi: 'फिनिश',
    fr: 'फ्रेंच',
    hi: 'हिंदी',
    hr: 'क्रोएशियाई',
    hu: 'हंगेरियन',
    id: 'इंडोनेशियाई',
    it: 'इटालियन',
    ja: 'जापानी',
    ko: 'कोरियाई',
    lt: 'लिथुआनियाई',
    nl: 'डच',
    no: 'नॉर्वेजियन',
    pl: 'पोलिश',
    'pt-BR': 'पुर्तगाली, ब्राज़ील',
    ro: 'रोमानियाई',
    ru: 'रूसी',
    'sv-SE': 'स्वीडिश',
    th: 'थाई',
    tr: 'तुर्की',
    uk: 'यूक्रेनियाई',
    vi: 'वियतनामी',
    'zh-CN': 'चीनी',
    'zh-TW': 'चीनी, ताइवान'
  }
})

export default hi