import WrapDataManager from '~/managers/WrapDataManager'

const hi = WrapDataManager.toI18n({
  commands: {
    language: {
      description: 'अनुवाद के लिए भाषा सेट करें',
      embed: {
        footer: {
          text: 'अधिकतम भाषा सेटिंग्स की संख्या: {0} / {1}'
        },
        title: 'अनुवाद भाषा सेटिंग स्क्रीन:'
      },
      maxDataLength: '>>> **※अधिकतम {0} भाषाएँ ही सेट की जा सकती हैं**'
    },
    translation: {
      content: '>>> **※किस भाषा में अनुवाद करें?**',
      selectLang: '>>> **※{0} में अनुवाद कर रहा है...**',
      undefined: '>>> **※अनुवाद भाषा सेट नहीं की गई हैकृपया `/setting` में सेट करें** '
    }
  },
  localizedNames: {
    bg: 'बल्गेरियाई',
    cs: 'चेक',
    da: 'डैनिश',
    de: 'जर्मन',
    el: 'ग्रीक',
    'en-GB': 'अंग्रेज़ी, यूके',
    'en-US': 'अंग्रेज़ी, यूएसए',
    'es-ES': 'स्पैनिश',
    fi: 'फिनिश',
    fr: 'फ्रेंच',
    hi: 'हिंदी',
    hr: 'क्रोएशियाई',
    hu: 'हंगेरियन',
    id: 'इंडोनेशियाई',
    it: 'इटालियन',
    ja: 'जापानी',
    ko: 'कोरियाई',
    lt: 'लिथुआनियाई',
    nl: 'डच',
    no: 'नॉर्वेजियन',
    pl: 'पोलिश',
    'pt-BR': 'पुर्तगाली, ब्राज़ील',
    ro: 'रोमानियाई',
    ru: 'रूसी',
    'sv-SE': 'स्वीडिश',
    th: 'थाई',
    tr: 'तुर्की',
    uk: 'यूक्रेनियाई',
    vi: 'वियतनामी',
    'zh-CN': 'चीनी',
    'zh-TW': 'चीनी, ताइवान'
  }
})

export default hi