import WrapDataManager from '~/managers/WrapDataManager'

const th = WrapDataManager.toI18n({
  commands: {
    language: {
      description: 'ตั้งค่าภาษาสำหรับการแปล',
      embed: {
        footer: {
          text: 'จำนวนการตั้งค่าภาษาสูงสุด: {0} / {1}'
        },
        title: 'หน้าจอการตั้งค่าภาษาการแปล:'
      },
      maxDataLength: '>>> **※สามารถตั้งค่าภาษาได้สูงสุด {0} ภาษา**'
    },
    translation: {
      content: '>>> **※แปลเป็นภาษาอะไร?**',
      selectLang: '>>> **※กำลังแปลเป็นภาษา {0}...**',
      undefined: '>>> **※ยังไม่ได้ตั้งค่าภาษาการแปล\\nกรุณาตั้งค่าใน `/setting`**'
    }
  },
  localizedNames: {
    bg: 'บัลแกเรีย',
    cs: 'เช็ก',
    da: 'เดนมาร์ก',
    de: 'เยอรมัน',
    el: 'กรีก',
    'en-GB': 'อังกฤษ, สหราชอาณาจักร',
    'en-US': 'อังกฤษ, สหรัฐอเมริกา',
    'es-ES': 'สเปน',
    fi: 'ฟินแลนด์',
    fr: 'ฝรั่งเศส',
    hi: 'ฮินดี',
    hr: 'โครเอเชีย',
    hu: 'ฮังการี',
    id: 'อินโดนีเซีย',
    it: 'อิตาลี',
    ja: 'ญี่ปุ่น',
    ko: 'เกาหลี',
    lt: 'ลิทัวเนีย',
    nl: 'ดัตช์',
    no: 'นอร์เวย์',
    pl: 'โปแลนด์',
    'pt-BR': 'โปรตุเกส, บราซิล',
    ro: 'โรมาเนีย',
    ru: 'รัสเซีย',
    'sv-SE': 'สวีเดน',
    th: 'ไทย',
    tr: 'ตุรกี',
    uk: 'ยูเครน',
    vi: 'เวียดนาม',
    'zh-CN': 'จีน',
    'zh-TW': 'จีน, ไต้หวัน'
  }
})

export default th