import WrapDataManager from '~/managers/WrapDataManager'

const th = WrapDataManager.toI18n({
  commands: {
    help: {
      description: 'วิธีการใช้งาน BOT',
      embeds: [{
        contents: ['ภาษาที่เลือกในปัจจุบัน', 'เลื่อนขึ้น', 'เลื่อนลง', 'เปิดใช้งานภาษา', 'ปิดใช้งานภาษา'],
        description: '**</setting:{0}> สามารถตั้งค่าผ่านคำสั่ง**',
        footer: {
          text: '※คำสั่งนี้สามารถใช้ได้เฉพาะเมื่อคุณมีสิทธิ์เต็ม'
        },
        title: 'วิธีการตั้งค่าภาษา:'
      }, {
        contents: ['คลิกขวา', 'คลิก'],
        type: 'คอมพิวเตอร์'
      }, {
        contents: ['กดค้าง', 'แตะ'],
        type: 'สมาร์ทโฟน'
      }],
      howToUseEmbed: {
        contents: ['เลือกข้อความที่คุณต้องการแปล {0}', '`แอปพลิเคชัน` สำหรับ {0}', '`แปล` สำหรับ {0}', 'เลือกภาษาที่คุณต้องการ {0}', 'การแปลเสร็จสิ้น'],
        description: 'ขั้นตอน:',
        title: 'วิธีการใช้งาน ({0}):'
      }
    },
    language: {
      description: 'ตั้งค่าภาษาสำหรับการแปล',
      embed: {
        footer: {
          text: 'จำนวนการตั้งค่าภาษาสูงสุด: {0} / {1}'
        },
        title: 'หน้าจอการตั้งค่าภาษาการแปล:'
      },
      maxDataLength: '>>> **※สามารถตั้งค่าภาษาได้สูงสุด {0} ภาษา**'
    },
    translation: {
      content: '>>> **※แปลเป็นภาษาอะไร?**',
      selectLang: '>>> **※กำลังแปลเป็นภาษา {0}...**',
      undefined: '>>> **※ยังไม่ได้ตั้งค่าภาษาการแปล\\nกรุณาตั้งค่าใน `/setting`**'
    }
  },
  localizedNames: {
    bg: 'บัลแกเรีย',
    cs: 'เช็ก',
    da: 'เดนมาร์ก',
    de: 'เยอรมัน',
    el: 'กรีก',
    'en-GB': 'อังกฤษ, สหราชอาณาจักร',
    'en-US': 'อังกฤษ, สหรัฐอเมริกา',
    'es-ES': 'สเปน',
    fi: 'ฟินแลนด์',
    fr: 'ฝรั่งเศส',
    hi: 'ฮินดี',
    hr: 'โครเอเชีย',
    hu: 'ฮังการี',
    id: 'อินโดนีเซีย',
    it: 'อิตาลี',
    ja: 'ญี่ปุ่น',
    ko: 'เกาหลี',
    lt: 'ลิทัวเนีย',
    nl: 'ดัตช์',
    no: 'นอร์เวย์',
    pl: 'โปแลนด์',
    'pt-BR': 'โปรตุเกส, บราซิล',
    ro: 'โรมาเนีย',
    ru: 'รัสเซีย',
    'sv-SE': 'สวีเดน',
    th: 'ไทย',
    tr: 'ตุรกี',
    uk: 'ยูเครน',
    vi: 'เวียดนาม',
    'zh-CN': 'จีน',
    'zh-TW': 'จีน, ไต้หวัน'
  }
})

export default th