import WrapDataManager from '~/managers/WrapDataManager'

const uk = WrapDataManager.toI18n({
  commands: {
    help: {
      description: 'Як користуватися BOT',
      embeds: [{
        contents: ['Поточно вибрана мова', 'Перемістити вгору', 'Перемістити вниз', 'Активувати мову', 'Деактивувати мову'],
        description: '**`/setting` Можна налаштувати через команду**',
        footer: {
          text: '※Ця команда доступна лише при наявності повних прав'
        },
        title: 'Метод налаштування мови:'
      }, {
        contents: ['Клік правою кнопкою', 'Клік'],
        type: 'ПК'
      }, {
        contents: ['Тримати натиснутою', 'Тап'],
        type: 'Смартфон'
      }],
      howToUseEmbed: {
        contents: ['Виберіть повідомлення для перекладу {0}', '`Додаток` для {0}', '`Перекласти` для {0}', 'Виберіть бажану мову {0}', 'Переклад завершено'],
        description: 'Кроки:',
        title: 'Інструкція користувача ({0}):'
      }
    },
    language: {
      description: 'Встановіть мову перекладу',
      embed: {
        footer: {
          text: 'Максимальна кількість налаштувань мови: {0} / {1}'
        },
        title: 'Екран налаштування мови перекладу:'
      },
      maxDataLength: '>>> **※Можна налаштувати максимум {0} мов**'
    },
    translation: {
      content: '>>> **※На яку мову перекласти?**',
      selectLang: '>>> **※Переклад на {0}...**',
      undefined: '>>> **※Мова перекладу не встановлена\nБудь ласка, налаштуйте її у `/setting`**'
    }
  },
  localizedNames: {
    bg: 'Болгарська',
    cs: 'Чеська',
    da: 'Данська',
    de: 'Німецька',
    el: 'Грецька',
    'en-GB': 'Англійська, Велика Британія',
    'en-US': 'Англійська, США',
    'es-ES': 'Іспанська',
    fi: 'Фінська',
    fr: 'Французька',
    hi: 'Гінді',
    hr: 'Хорватська',
    hu: 'Угорська',
    id: 'Індонезійська',
    it: 'Італійська',
    ja: 'Японська',
    ko: 'Корейська',
    lt: 'Литовська',
    nl: 'Голландська',
    no: 'Норвезька',
    pl: 'Польська',
    'pt-BR': 'Португальська, Бразилія',
    ro: 'Румунська',
    ru: 'Російська',
    'sv-SE': 'Шведська',
    th: 'Тайська',
    tr: 'Турецька',
    uk: 'Українська',
    vi: 'Вєтнамська',
    'zh-CN': 'Китайська',
    'zh-TW': 'Китайська, Тайвань'
  }
})

export default uk